app/Http/Controllers/RoomController.php

    public function index_withCountSeats()
    {
        return view('pages/home', ['rooms' => Room::withCount(['seat' => function ($q) {
            $q
                ->whereDoesntHave("booking", function ($query) {
                    $query
                        ->where('from',  '<=', Carbon::now())
                        ->where('to',  '>=', Carbon::now());
                });
        }])->get()]);
---
select `rooms`.*, (select count(*) from `seats` where `rooms`.`id` = `seats`.`room_id` and not exists (select * from `bookings` where `seats`.`id` = `bookings`.`seat_id` and `from` <= '2021-10-14 07:03:29' and `to` >= '2021-10-14 07:03:29')) as `seat_count` from `rooms`