app/Http/Controllers/RoomController.php

select * from `rooms` where `id` = '1'
---
    public function save($id, Request $request)
    {
        $room = Room::find($id);

select * from `bookings` where `bookings`.`seat_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10)
---
    public function index_withCountSeats()
    {
        return view('pages/home', ['rooms' => Room::withCount(['seat' => function ($q) {
            $q
                ->whereDoesntHave("booking", function ($query) {
                    $query
                        ->where('from',  '<=', Carbon::now())
                        ->where('to',  '>=', Carbon::now());
                });
        }])->get()]);

select * from `seats` where `seats`.`room_id` in (1) order by CHAR_LENGTH(seat_number), `seat_number` asc
---
    public function show($id)
    {
        return View(
            'pages/seats',
            ['room' => Room::where('id', $id)
                ->with(['seat' => function ($query) {
                    if (env('DB_CONNECTION') == "mysql") {
                        $query->orderByRaw('CHAR_LENGTH(seat_number)');
                    } else {
                        $query->orderByRaw('LENGTH(seat_number)');
                    }
                    $query->orderBy('seat_number', 'asc');
                }, 'seat.booking' => function ($query) {
                    $query
                        ->where('from', '<=', Carbon::now())
                        ->where('to', '>=', Carbon::now());
                    $query->with('user');
                }])
                ->get()]
        );